tlonch/contiki_ved/examples/nrf52dk/nrf51-sht2x-library-master/io70f3740.h
/*-------------------------------------------------------------------------
 *      Declarations of Peripheral I/O registers, I/O register bits,
 *      Interrupt/Exeption vectors, Trap vectors and, V850E only, Callt
 *      vectors for V850ES microcontroller uPD70F3740.
 *
 *      This header file can be used by both the V850 assembler, AV850,
 *      and the V850 C/C++ compiler, ICCV850.
 *
 *      This header file is generated from the device file:
 *          DF3740.800
 *          Copyright (C) NEC Corporation 2007
 *          Format version 2.20, File version 1.10 *
 *-------------------------------------------------------------------------*/

#ifndef __IO70F3740_H__
#define __IO70F3740_H__

#if ((__TID__ >> 8) & 0x7F) != 85
#error "IO70F3740.H file for use with AV850 / ICCV850 only"
#endif

#if ((__TID__ >> 4) & 0x0F) != 1
#error "IO70F3740.H file for use with AV850 / ICCV850 option -v1 only"
#endif

#pragma language=extended
#pragma system_include

/***********************************************
 *       I/O register macros
 ***********************************************/

#include "io_macros.h"

/***********************************************
 *       Peripheral I/O register declarations
 ***********************************************/


__IO_REG16(     PDL,             0xFFFFF004,  __READ_WRITE )
__IO_REG8_BIT(  PDLL,            0xFFFFF004,  __READ_WRITE )
__IO_REG8_BIT(  PDLH,            0xFFFFF005,  __READ_WRITE )
__IO_REG8_BIT(  PDH,             0xFFFFF006,  __READ_WRITE )

__IO_REG8_BIT(  PCT,             0xFFFFF00A,  __READ_WRITE )
__IO_REG8_BIT(  PCM,             0xFFFFF00C,  __READ_WRITE )

__IO_REG16(     PMDL,            0xFFFFF024,  __READ_WRITE )
__IO_REG8_BIT(  PMDLL,           0xFFFFF024,  __READ_WRITE )
__IO_REG8_BIT(  PMDLH,           0xFFFFF025,  __READ_WRITE )
__IO_REG8_BIT(  PMDH,            0xFFFFF026,  __READ_WRITE )

__IO_REG8_BIT(  PMCT,            0xFFFFF02A,  __READ_WRITE )
__IO_REG8_BIT(  PMCM,            0xFFFFF02C,  __READ_WRITE )

__IO_REG16(     PMCDL,           0xFFFFF044,  __READ_WRITE )
__IO_REG8_BIT(  PMCDLL,          0xFFFFF044,  __READ_WRITE )
__IO_REG8_BIT(  PMCDLH,          0xFFFFF045,  __READ_WRITE )
__IO_REG8_BIT(  PMCDH,           0xFFFFF046,  __READ_WRITE )

__IO_REG8_BIT(  PMCCT,           0xFFFFF04A,  __READ_WRITE )
__IO_REG8_BIT(  PMCCM,           0xFFFFF04C,  __READ_WRITE )

__IO_REG16(     BSC,             0xFFFFF066,  __READ_WRITE )

__IO_REG8(      VSWC,            0xFFFFF06E,  __READ_WRITE )

__IO_REG16(     DSA0L,           0xFFFFF080,  __READ_WRITE )
__IO_REG16(     DSA0H,           0xFFFFF082,  __READ_WRITE )
__IO_REG16(     DDA0L,           0xFFFFF084,  __READ_WRITE )
__IO_REG16(     DDA0H,           0xFFFFF086,  __READ_WRITE )
__IO_REG16(     DSA1L,           0xFFFFF088,  __READ_WRITE )
__IO_REG16(     DSA1H,           0xFFFFF08A,  __READ_WRITE )
__IO_REG16(     DDA1L,           0xFFFFF08C,  __READ_WRITE )
__IO_REG16(     DDA1H,           0xFFFFF08E,  __READ_WRITE )
__IO_REG16(     DSA2L,           0xFFFFF090,  __READ_WRITE )
__IO_REG16(     DSA2H,           0xFFFFF092,  __READ_WRITE )
__IO_REG16(     DDA2L,           0xFFFFF094,  __READ_WRITE )
__IO_REG16(     DDA2H,           0xFFFFF096,  __READ_WRITE )
__IO_REG16(     DSA3L,           0xFFFFF098,  __READ_WRITE )
__IO_REG16(     DSA3H,           0xFFFFF09A,  __READ_WRITE )
__IO_REG16(     DDA3L,           0xFFFFF09C,  __READ_WRITE )
__IO_REG16(     DDA3H,           0xFFFFF09E,  __READ_WRITE )

__IO_REG16(     DBC0,            0xFFFFF0C0,  __READ_WRITE )
__IO_REG16(     DBC1,            0xFFFFF0C2,  __READ_WRITE )
__IO_REG16(     DBC2,            0xFFFFF0C4,  __READ_WRITE )
__IO_REG16(     DBC3,            0xFFFFF0C6,  __READ_WRITE )

__IO_REG16(     DADC0,           0xFFFFF0D0,  __READ_WRITE )
__IO_REG16(     DADC1,           0xFFFFF0D2,  __READ_WRITE )
__IO_REG16(     DADC2,           0xFFFFF0D4,  __READ_WRITE )
__IO_REG16(     DADC3,           0xFFFFF0D6,  __READ_WRITE )

__IO_REG8_BIT(  DCHC0,           0xFFFFF0E0,  __READ_WRITE )
__IO_REG8_BIT(  DCHC1,           0xFFFFF0E2,  __READ_WRITE )
__IO_REG8_BIT(  DCHC2,           0xFFFFF0E4,  __READ_WRITE )
__IO_REG8_BIT(  DCHC3,           0xFFFFF0E6,  __READ_WRITE )

__IO_REG16(     IMR0,            0xFFFFF100,  __READ_WRITE )
__IO_REG8_BIT(  IMR0L,           0xFFFFF100,  __READ_WRITE )
__IO_REG8_BIT(  IMR0H,           0xFFFFF101,  __READ_WRITE )
__IO_REG16(     IMR1,            0xFFFFF102,  __READ_WRITE )
__IO_REG8_BIT(  IMR1L,           0xFFFFF102,  __READ_WRITE )
__IO_REG8_BIT(  IMR1H,           0xFFFFF103,  __READ_WRITE )
__IO_REG16(     IMR2,            0xFFFFF104,  __READ_WRITE )
__IO_REG8_BIT(  IMR2L,           0xFFFFF104,  __READ_WRITE )
__IO_REG8_BIT(  IMR2H,           0xFFFFF105,  __READ_WRITE )
__IO_REG16(     IMR3,            0xFFFFF106,  __READ_WRITE )
__IO_REG8_BIT(  IMR3L,           0xFFFFF106,  __READ_WRITE )

__IO_REG8_BIT(  LVIIC,           0xFFFFF110,  __READ_WRITE )
__IO_REG8_BIT(  PIC0,            0xFFFFF112,  __READ_WRITE )
__IO_REG8_BIT(  PIC1,            0xFFFFF114,  __READ_WRITE )
__IO_REG8_BIT(  PIC2,            0xFFFFF116,  __READ_WRITE )
__IO_REG8_BIT(  PIC3,            0xFFFFF118,  __READ_WRITE )
__IO_REG8_BIT(  PIC4,            0xFFFFF11A,  __READ_WRITE )
__IO_REG8_BIT(  PIC5,            0xFFFFF11C,  __READ_WRITE )
__IO_REG8_BIT(  PIC6,            0xFFFFF11E,  __READ_WRITE )
__IO_REG8_BIT(  PIC7,            0xFFFFF120,  __READ_WRITE )
__IO_REG8_BIT(  TQ0OVIC,         0xFFFFF122,  __READ_WRITE )
__IO_REG8_BIT(  TQ0CCIC0,        0xFFFFF124,  __READ_WRITE )
__IO_REG8_BIT(  TQ0CCIC1,        0xFFFFF126,  __READ_WRITE )
__IO_REG8_BIT(  TQ0CCIC2,        0xFFFFF128,  __READ_WRITE )
__IO_REG8_BIT(  TQ0CCIC3,        0xFFFFF12A,  __READ_WRITE )
__IO_REG8_BIT(  TP0OVIC,         0xFFFFF12C,  __READ_WRITE )
__IO_REG8_BIT(  TP0CCIC0,        0xFFFFF12E,  __READ_WRITE )
__IO_REG8_BIT(  TP0CCIC1,        0xFFFFF130,  __READ_WRITE )
__IO_REG8_BIT(  TP1OVIC,         0xFFFFF132,  __READ_WRITE )
__IO_REG8_BIT(  TP1CCIC0,        0xFFFFF134,  __READ_WRITE )
__IO_REG8_BIT(  TP1CCIC1,        0xFFFFF136,  __READ_WRITE )
__IO_REG8_BIT(  TP2OVIC,         0xFFFFF138,  __READ_WRITE )
__IO_REG8_BIT(  TP2CCIC0,        0xFFFFF13A,  __READ_WRITE )
__IO_REG8_BIT(  TP2CCIC1,        0xFFFFF13C,  __READ_WRITE )
__IO_REG8_BIT(  TP3OVIC,         0xFFFFF13E,  __READ_WRITE )
__IO_REG8_BIT(  TP3CCIC0,        0xFFFFF140,  __READ_WRITE )
__IO_REG8_BIT(  TP3CCIC1,        0xFFFFF142,  __READ_WRITE )
__IO_REG8_BIT(  TP4OVIC,         0xFFFFF144,  __READ_WRITE )
__IO_REG8_BIT(  TP4CCIC0,        0xFFFFF146,  __READ_WRITE )
__IO_REG8_BIT(  TP4CCIC1,        0xFFFFF148,  __READ_WRITE )
__IO_REG8_BIT(  TP5OVIC,         0xFFFFF14A,  __READ_WRITE )
__IO_REG8_BIT(  TP5CCIC0,        0xFFFFF14C,  __READ_WRITE )
__IO_REG8_BIT(  TP5CCIC1,        0xFFFFF14E,  __READ_WRITE )
__IO_REG8_BIT(  TM0EQIC0,        0xFFFFF150,  __READ_WRITE )
__IO_REG8_BIT(  CB0RIC,          0xFFFFF152,  __READ_WRITE )
__IO_REG8_BIT(  IICIC1,          0xFFFFF152,  __READ_WRITE )
__IO_REG8_BIT(  CB0TIC,          0xFFFFF154,  __READ_WRITE )
__IO_REG8_BIT(  CB1RIC,          0xFFFFF156,  __READ_WRITE )
__IO_REG8_BIT(  CB1TIC,          0xFFFFF158,  __READ_WRITE )
__IO_REG8_BIT(  CB2RIC,          0xFFFFF15A,  __READ_WRITE )
__IO_REG8_BIT(  CB2TIC,          0xFFFFF15C,  __READ_WRITE )
__IO_REG8_BIT(  CB3RIC,          0xFFFFF15E,  __READ_WRITE )
__IO_REG8_BIT(  CB3TIC,          0xFFFFF160,  __READ_WRITE )
__IO_REG8_BIT(  CB4RIC,          0xFFFFF162,  __READ_WRITE )
__IO_REG8_BIT(  UA0RIC,          0xFFFFF162,  __READ_WRITE )
__IO_REG8_BIT(  CB4TIC,          0xFFFFF164,  __READ_WRITE )
__IO_REG8_BIT(  UA0TIC,          0xFFFFF164,  __READ_WRITE )
__IO_REG8_BIT(  IICIC2,          0xFFFFF166,  __READ_WRITE )
__IO_REG8_BIT(  UA1RIC,          0xFFFFF166,  __READ_WRITE )
__IO_REG8_BIT(  UA1TIC,          0xFFFFF168,  __READ_WRITE )
__IO_REG8_BIT(  IICIC0,          0xFFFFF16A,  __READ_WRITE )
__IO_REG8_BIT(  UA2RIC,          0xFFFFF16A,  __READ_WRITE )
__IO_REG8_BIT(  UA2TIC,          0xFFFFF16C,  __READ_WRITE )
__IO_REG8_BIT(  ADIC,            0xFFFFF16E,  __READ_WRITE )
__IO_REG8_BIT(  DMAIC0,          0xFFFFF170,  __READ_WRITE )
__IO_REG8_BIT(  DMAIC1,          0xFFFFF172,  __READ_WRITE )
__IO_REG8_BIT(  DMAIC2,          0xFFFFF174,  __READ_WRITE )
__IO_REG8_BIT(  DMAIC3,          0xFFFFF176,  __READ_WRITE )
__IO_REG8_BIT(  KRIC,            0xFFFFF178,  __READ_WRITE )
__IO_REG8_BIT(  WTIIC,           0xFFFFF17A,  __READ_WRITE )
__IO_REG8_BIT(  WTIC,            0xFFFFF17C,  __READ_WRITE )

