tlonch/contiki_ved/examples/nrf52dk/nrf51-sht2x-library-master/io70f3740.h
__IO_REG8_BIT(  ISPR,            0xFFFFF1FA,  __READ       )
__IO_REG8(      PRCMD,           0xFFFFF1FC,  __WRITE      )
__IO_REG8_BIT(  PSC,             0xFFFFF1FE,  __READ_WRITE )
__IO_REG8_BIT(  ADA0M0,          0xFFFFF200,  __READ_WRITE )
__IO_REG8_BIT(  ADA0M1,          0xFFFFF201,  __READ_WRITE )
__IO_REG8_BIT(  ADA0S,           0xFFFFF202,  __READ_WRITE )
__IO_REG8_BIT(  ADA0M2,          0xFFFFF203,  __READ_WRITE )
__IO_REG8_BIT(  ADA0PFM,         0xFFFFF204,  __READ_WRITE )
__IO_REG8_BIT(  ADA0PFT,         0xFFFFF205,  __READ_WRITE )

__IO_REG16(     ADA0CR0,         0xFFFFF210,  __READ       )
__IO_REG8(      ADA0CR0H,        0xFFFFF211,  __READ       )
__IO_REG16(     ADA0CR1,         0xFFFFF212,  __READ       )
__IO_REG8(      ADA0CR1H,        0xFFFFF213,  __READ       )
__IO_REG16(     ADA0CR2,         0xFFFFF214,  __READ       )
__IO_REG8(      ADA0CR2H,        0xFFFFF215,  __READ       )
__IO_REG16(     ADA0CR3,         0xFFFFF216,  __READ       )
__IO_REG8(      ADA0CR3H,        0xFFFFF217,  __READ       )
__IO_REG16(     ADA0CR4,         0xFFFFF218,  __READ       )
__IO_REG8(      ADA0CR4H,        0xFFFFF219,  __READ       )
__IO_REG16(     ADA0CR5,         0xFFFFF21A,  __READ       )
__IO_REG8(      ADA0CR5H,        0xFFFFF21B,  __READ       )
__IO_REG16(     ADA0CR6,         0xFFFFF21C,  __READ       )
__IO_REG8(      ADA0CR6H,        0xFFFFF21D,  __READ       )
__IO_REG16(     ADA0CR7,         0xFFFFF21E,  __READ       )
__IO_REG8(      ADA0CR7H,        0xFFFFF21F,  __READ       )
__IO_REG16(     ADA0CR8,         0xFFFFF220,  __READ       )
__IO_REG8(      ADA0CR8H,        0xFFFFF221,  __READ       )
__IO_REG16(     ADA0CR9,         0xFFFFF222,  __READ       )
__IO_REG8(      ADA0CR9H,        0xFFFFF223,  __READ       )
__IO_REG16(     ADA0CR10,        0xFFFFF224,  __READ       )
__IO_REG8(      ADA0CR10H,       0xFFFFF225,  __READ       )
__IO_REG16(     ADA0CR11,        0xFFFFF226,  __READ       )
__IO_REG8(      ADA0CR11H,       0xFFFFF227,  __READ       )

__IO_REG8(      DA0CS0,          0xFFFFF280,  __READ_WRITE )
__IO_REG8(      DA0CS1,          0xFFFFF281,  __READ_WRITE )
__IO_REG8_BIT(  DA0M,            0xFFFFF282,  __READ_WRITE )

__IO_REG8_BIT(  KRM,             0xFFFFF300,  __READ_WRITE )

__IO_REG8_BIT(  SELCNT0,         0xFFFFF308,  __READ_WRITE )

__IO_REG8(      CRCIN,           0xFFFFF310,  __READ_WRITE )
__IO_REG16(     CRCD,            0xFFFFF312,  __READ_WRITE )

__IO_REG8(      NFC,             0xFFFFF318,  __READ_WRITE )

__IO_REG8_BIT(  PRSM1,           0xFFFFF320,  __READ_WRITE )
__IO_REG8(      PRSCM1,          0xFFFFF321,  __READ_WRITE )

__IO_REG8_BIT(  PRSM2,           0xFFFFF324,  __READ_WRITE )
__IO_REG8(      PRSCM2,          0xFFFFF325,  __READ_WRITE )

__IO_REG8_BIT(  PRSM3,           0xFFFFF328,  __READ_WRITE )
__IO_REG8(      PRSCM3,          0xFFFFF329,  __READ_WRITE )

__IO_REG8(      OCKS0,           0xFFFFF340,  __READ_WRITE )

__IO_REG8(      OCKS1,           0xFFFFF344,  __READ_WRITE )

__IO_REG8_BIT(  P0,              0xFFFFF400,  __READ_WRITE )
__IO_REG8_BIT(  P1,              0xFFFFF402,  __READ_WRITE )

__IO_REG16(     P3,              0xFFFFF406,  __READ_WRITE )
__IO_REG8_BIT(  P3L,             0xFFFFF406,  __READ_WRITE )
__IO_REG8_BIT(  P3H,             0xFFFFF407,  __READ_WRITE )
__IO_REG8_BIT(  P4,              0xFFFFF408,  __READ_WRITE )
__IO_REG8_BIT(  P5,              0xFFFFF40A,  __READ_WRITE )

__IO_REG8_BIT(  P7L,             0xFFFFF40E,  __READ_WRITE )
__IO_REG8_BIT(  P7H,             0xFFFFF40F,  __READ_WRITE )

__IO_REG16(     P9,              0xFFFFF412,  __READ_WRITE )
__IO_REG8_BIT(  P9L,             0xFFFFF412,  __READ_WRITE )
__IO_REG8_BIT(  P9H,             0xFFFFF413,  __READ_WRITE )

__IO_REG8_BIT(  PM0,             0xFFFFF420,  __READ_WRITE )
__IO_REG8_BIT(  PM1,             0xFFFFF422,  __READ_WRITE )

__IO_REG16(     PM3,             0xFFFFF426,  __READ_WRITE )
__IO_REG8_BIT(  PM3L,            0xFFFFF426,  __READ_WRITE )
__IO_REG8_BIT(  PM3H,            0xFFFFF427,  __READ_WRITE )
__IO_REG8_BIT(  PM4,             0xFFFFF428,  __READ_WRITE )
__IO_REG8_BIT(  PM5,             0xFFFFF42A,  __READ_WRITE )

__IO_REG8_BIT(  PM7L,            0xFFFFF42E,  __READ_WRITE )
__IO_REG8_BIT(  PM7H,            0xFFFFF42F,  __READ_WRITE )

__IO_REG16(     PM9,             0xFFFFF432,  __READ_WRITE )
__IO_REG8_BIT(  PM9L,            0xFFFFF432,  __READ_WRITE )
__IO_REG8_BIT(  PM9H,            0xFFFFF433,  __READ_WRITE )

__IO_REG8_BIT(  PMC0,            0xFFFFF440,  __READ_WRITE )

__IO_REG16(     PMC3,            0xFFFFF446,  __READ_WRITE )
__IO_REG8_BIT(  PMC3L,           0xFFFFF446,  __READ_WRITE )
__IO_REG8_BIT(  PMC3H,           0xFFFFF447,  __READ_WRITE )
__IO_REG8_BIT(  PMC4,            0xFFFFF448,  __READ_WRITE )
__IO_REG8_BIT(  PMC5,            0xFFFFF44A,  __READ_WRITE )

__IO_REG16(     PMC9,            0xFFFFF452,  __READ_WRITE )
__IO_REG8_BIT(  PMC9L,           0xFFFFF452,  __READ_WRITE )
__IO_REG8_BIT(  PMC9H,           0xFFFFF453,  __READ_WRITE )

__IO_REG8_BIT(  PFC0,            0xFFFFF460,  __READ_WRITE )

__IO_REG16(     PFC3,            0xFFFFF466,  __READ_WRITE )
__IO_REG8_BIT(  PFC3L,           0xFFFFF466,  __READ_WRITE )
__IO_REG8_BIT(  PFC3H,           0xFFFFF467,  __READ_WRITE )
__IO_REG8_BIT(  PFC4,            0xFFFFF468,  __READ_WRITE )
__IO_REG8_BIT(  PFC5,            0xFFFFF46A,  __READ_WRITE )

__IO_REG16(     PFC9,            0xFFFFF472,  __READ_WRITE )
__IO_REG8_BIT(  PFC9L,           0xFFFFF472,  __READ_WRITE )
__IO_REG8_BIT(  PFC9H,           0xFFFFF473,  __READ_WRITE )

__IO_REG16(     DWC0,            0xFFFFF484,  __READ_WRITE )

__IO_REG16(     AWC,             0xFFFFF488,  __READ_WRITE )
__IO_REG16(     BCC,             0xFFFFF48A,  __READ_WRITE )

__IO_REG8_BIT(  TQ0CTL0,         0xFFFFF540,  __READ_WRITE )
__IO_REG8_BIT(  TQ0CTL1,         0xFFFFF541,  __READ_WRITE )
__IO_REG8_BIT(  TQ0IOC0,         0xFFFFF542,  __READ_WRITE )
__IO_REG8_BIT(  TQ0IOC1,         0xFFFFF543,  __READ_WRITE )
__IO_REG8_BIT(  TQ0IOC2,         0xFFFFF544,  __READ_WRITE )
__IO_REG8_BIT(  TQ0OPT0,         0xFFFFF545,  __READ_WRITE )
__IO_REG16(     TQ0CCR0,         0xFFFFF546,  __READ_WRITE )
__IO_REG16(     TQ0CCR1,         0xFFFFF548,  __READ_WRITE )
__IO_REG16(     TQ0CCR2,         0xFFFFF54A,  __READ_WRITE )
__IO_REG16(     TQ0CCR3,         0xFFFFF54C,  __READ_WRITE )
__IO_REG16(     TQ0CNT,          0xFFFFF54E,  __READ       )

__IO_REG8_BIT(  TP0CTL0,         0xFFFFF590,  __READ_WRITE )
__IO_REG8_BIT(  TP0CTL1,         0xFFFFF591,  __READ_WRITE )
__IO_REG8_BIT(  TP0IOC0,         0xFFFFF592,  __READ_WRITE )
__IO_REG8_BIT(  TP0IOC1,         0xFFFFF593,  __READ_WRITE )
__IO_REG8_BIT(  TP0IOC2,         0xFFFFF594,  __READ_WRITE )
__IO_REG8_BIT(  TP0OPT0,         0xFFFFF595,  __READ_WRITE )
__IO_REG16(     TP0CCR0,         0xFFFFF596,  __READ_WRITE )
__IO_REG16(     TP0CCR1,         0xFFFFF598,  __READ_WRITE )
__IO_REG16(     TP0CNT,          0xFFFFF59A,  __READ       )

__IO_REG8_BIT(  TP1CTL0,         0xFFFFF5A0,  __READ_WRITE )
__IO_REG8_BIT(  TP1CTL1,         0xFFFFF5A1,  __READ_WRITE )
__IO_REG8_BIT(  TP1IOC0,         0xFFFFF5A2,  __READ_WRITE )
__IO_REG8_BIT(  TP1IOC1,         0xFFFFF5A3,  __READ_WRITE )
__IO_REG8_BIT(  TP1IOC2,         0xFFFFF5A4,  __READ_WRITE )
__IO_REG8_BIT(  TP1OPT0,         0xFFFFF5A5,  __READ_WRITE )
__IO_REG16(     TP1CCR0,         0xFFFFF5A6,  __READ_WRITE )
__IO_REG16(     TP1CCR1,         0xFFFFF5A8,  __READ_WRITE )
__IO_REG16(     TP1CNT,          0xFFFFF5AA,  __READ       )

