tlonch/contiki_ved/examples/nrf52dk/nrf51-sht2x-library-master/io70f3740.h
__IO_REG8_BIT(  TP2CTL0,         0xFFFFF5B0,  __READ_WRITE )
__IO_REG8_BIT(  TP2CTL1,         0xFFFFF5B1,  __READ_WRITE )
__IO_REG8_BIT(  TP2IOC0,         0xFFFFF5B2,  __READ_WRITE )
__IO_REG8_BIT(  TP2IOC1,         0xFFFFF5B3,  __READ_WRITE )
__IO_REG8_BIT(  TP2IOC2,         0xFFFFF5B4,  __READ_WRITE )
__IO_REG8_BIT(  TP2OPT0,         0xFFFFF5B5,  __READ_WRITE )
__IO_REG16(     TP2CCR0,         0xFFFFF5B6,  __READ_WRITE )
__IO_REG16(     TP2CCR1,         0xFFFFF5B8,  __READ_WRITE )
__IO_REG16(     TP2CNT,          0xFFFFF5BA,  __READ       )

__IO_REG8_BIT(  TP3CTL0,         0xFFFFF5C0,  __READ_WRITE )
__IO_REG8_BIT(  TP3CTL1,         0xFFFFF5C1,  __READ_WRITE )
__IO_REG8_BIT(  TP3IOC0,         0xFFFFF5C2,  __READ_WRITE )
__IO_REG8_BIT(  TP3IOC1,         0xFFFFF5C3,  __READ_WRITE )
__IO_REG8_BIT(  TP3IOC2,         0xFFFFF5C4,  __READ_WRITE )
__IO_REG8_BIT(  TP3OPT0,         0xFFFFF5C5,  __READ_WRITE )
__IO_REG16(     TP3CCR0,         0xFFFFF5C6,  __READ_WRITE )
__IO_REG16(     TP3CCR1,         0xFFFFF5C8,  __READ_WRITE )
__IO_REG16(     TP3CNT,          0xFFFFF5CA,  __READ       )

__IO_REG8_BIT(  TP4CTL0,         0xFFFFF5D0,  __READ_WRITE )
__IO_REG8_BIT(  TP4CTL1,         0xFFFFF5D1,  __READ_WRITE )
__IO_REG8_BIT(  TP4IOC0,         0xFFFFF5D2,  __READ_WRITE )
__IO_REG8_BIT(  TP4IOC1,         0xFFFFF5D3,  __READ_WRITE )
__IO_REG8_BIT(  TP4IOC2,         0xFFFFF5D4,  __READ_WRITE )
__IO_REG8_BIT(  TP4OPT0,         0xFFFFF5D5,  __READ_WRITE )
__IO_REG16(     TP4CCR0,         0xFFFFF5D6,  __READ_WRITE )
__IO_REG16(     TP4CCR1,         0xFFFFF5D8,  __READ_WRITE )
__IO_REG16(     TP4CNT,          0xFFFFF5DA,  __READ       )

__IO_REG8_BIT(  TP5CTL0,         0xFFFFF5E0,  __READ_WRITE )
__IO_REG8_BIT(  TP5CTL1,         0xFFFFF5E1,  __READ_WRITE )
__IO_REG8_BIT(  TP5IOC0,         0xFFFFF5E2,  __READ_WRITE )
__IO_REG8_BIT(  TP5IOC1,         0xFFFFF5E3,  __READ_WRITE )
__IO_REG8_BIT(  TP5IOC2,         0xFFFFF5E4,  __READ_WRITE )
__IO_REG8_BIT(  TP5OPT0,         0xFFFFF5E5,  __READ_WRITE )
__IO_REG16(     TP5CCR0,         0xFFFFF5E6,  __READ_WRITE )
__IO_REG16(     TP5CCR1,         0xFFFFF5E8,  __READ_WRITE )
__IO_REG16(     TP5CNT,          0xFFFFF5EA,  __READ       )

__IO_REG8_BIT(  WTM,             0xFFFFF680,  __READ_WRITE )

__IO_REG8_BIT(  TM0CTL0,         0xFFFFF690,  __READ_WRITE )

__IO_REG16(     TM0CMP0,         0xFFFFF694,  __READ_WRITE )

__IO_REG8(      OSTS,            0xFFFFF6C0,  __READ_WRITE )
__IO_REG8(      PLLS,            0xFFFFF6C1,  __READ_WRITE )

__IO_REG8(      WDTM2,           0xFFFFF6D0,  __READ_WRITE )
__IO_REG8(      WDTE,            0xFFFFF6D1,  __READ_WRITE )

__IO_REG8_BIT(  RTBL0,           0xFFFFF6E0,  __READ_WRITE )
__IO_REG8_BIT(  RTBH0,           0xFFFFF6E2,  __READ_WRITE )
__IO_REG8_BIT(  RTPM0,           0xFFFFF6E4,  __READ_WRITE )
__IO_REG8_BIT(  RTPC0,           0xFFFFF6E5,  __READ_WRITE )

__IO_REG8_BIT(  PFCE3L,          0xFFFFF706,  __READ_WRITE )

__IO_REG8_BIT(  PFCE5,           0xFFFFF70A,  __READ_WRITE )

__IO_REG16(     PFCE9,           0xFFFFF712,  __READ_WRITE )
__IO_REG8_BIT(  PFCE9L,          0xFFFFF712,  __READ_WRITE )
__IO_REG8_BIT(  PFCE9H,          0xFFFFF713,  __READ_WRITE )

__IO_REG8_BIT(  SYS,             0xFFFFF802,  __READ_WRITE )

__IO_REG8_BIT(  RCM,             0xFFFFF80C,  __READ_WRITE )

__IO_REG8_BIT(  DTFR0,           0xFFFFF810,  __READ_WRITE )
__IO_REG8_BIT(  DTFR1,           0xFFFFF812,  __READ_WRITE )
__IO_REG8_BIT(  DTFR2,           0xFFFFF814,  __READ_WRITE )
__IO_REG8_BIT(  DTFR3,           0xFFFFF816,  __READ_WRITE )

__IO_REG8_BIT(  PSMR,            0xFFFFF820,  __READ_WRITE )
__IO_REG8_BIT(  CKC,             0xFFFFF822,  __READ_WRITE )
__IO_REG8_BIT(  LOCKR,           0xFFFFF824,  __READ       )

__IO_REG8_BIT(  PCC,             0xFFFFF828,  __READ_WRITE )

__IO_REG8_BIT(  PLLCTL,          0xFFFFF82C,  __READ_WRITE )
__IO_REG8_BIT(  CCLS,            0xFFFFF82E,  __READ       )

__IO_REG8_BIT(  CLM,             0xFFFFF870,  __READ_WRITE )

__IO_REG8_BIT(  RESF,            0xFFFFF888,  __READ_WRITE )

__IO_REG8_BIT(  LVIM,            0xFFFFF890,  __READ_WRITE )
__IO_REG8(      LVIS,            0xFFFFF891,  __READ_WRITE )
__IO_REG8_BIT(  RAMS,            0xFFFFF892,  __READ_WRITE )

__IO_REG8_BIT(  PRSM0,           0xFFFFF8B0,  __READ_WRITE )
__IO_REG8(      PRSCM0,          0xFFFFF8B1,  __READ_WRITE )

__IO_REG8_BIT(  OCDM,            0xFFFFF9FC,  __READ_WRITE )
__IO_REG8_BIT(  PEMU1,           0xFFFFF9FE,  __READ_WRITE )
__IO_REG8_BIT(  UA0CTL0,         0xFFFFFA00,  __READ_WRITE )
__IO_REG8(      UA0CTL1,         0xFFFFFA01,  __READ_WRITE )
__IO_REG8(      UA0CTL2,         0xFFFFFA02,  __READ_WRITE )
__IO_REG8_BIT(  UA0OPT0,         0xFFFFFA03,  __READ_WRITE )
__IO_REG8_BIT(  UA0STR,          0xFFFFFA04,  __READ_WRITE )
__IO_REG8(      UA0RX,           0xFFFFFA06,  __READ       )
__IO_REG8(      UA0TX,           0xFFFFFA07,  __READ_WRITE )

__IO_REG8_BIT(  UA1CTL0,         0xFFFFFA10,  __READ_WRITE )
__IO_REG8(      UA1CTL1,         0xFFFFFA11,  __READ_WRITE )
__IO_REG8(      UA1CTL2,         0xFFFFFA12,  __READ_WRITE )
__IO_REG8_BIT(  UA1OPT0,         0xFFFFFA13,  __READ_WRITE )
__IO_REG8_BIT(  UA1STR,          0xFFFFFA14,  __READ_WRITE )
__IO_REG8(      UA1RX,           0xFFFFFA16,  __READ       )
__IO_REG8(      UA1TX,           0xFFFFFA17,  __READ_WRITE )

__IO_REG8_BIT(  UA2CTL0,         0xFFFFFA20,  __READ_WRITE )
__IO_REG8(      UA2CTL1,         0xFFFFFA21,  __READ_WRITE )
__IO_REG8(      UA2CTL2,         0xFFFFFA22,  __READ_WRITE )
__IO_REG8_BIT(  UA2OPT0,         0xFFFFFA23,  __READ_WRITE )
__IO_REG8_BIT(  UA2STR,          0xFFFFFA24,  __READ_WRITE )
__IO_REG8(      UA2RX,           0xFFFFFA26,  __READ       )
__IO_REG8(      UA2TX,           0xFFFFFA27,  __READ_WRITE )

__IO_REG8_BIT(  INTF0,           0xFFFFFC00,  __READ_WRITE )

__IO_REG8_BIT(  INTF3,           0xFFFFFC06,  __READ_WRITE )

__IO_REG8_BIT(  INTF9H,          0xFFFFFC13,  __READ_WRITE )

__IO_REG8_BIT(  INTR0,           0xFFFFFC20,  __READ_WRITE )

__IO_REG8_BIT(  INTR3,           0xFFFFFC26,  __READ_WRITE )

