tlonch/contiki_ved/examples/nrf52dk/nrf51-sht2x-library-master/io70f3740.h
__IO_REG8_BIT(  INTR9H,          0xFFFFFC33,  __READ_WRITE )

__IO_REG8_BIT(  PF0,             0xFFFFFC60,  __READ_WRITE )

__IO_REG16(     PF3,             0xFFFFFC66,  __READ_WRITE )
__IO_REG8_BIT(  PF3L,            0xFFFFFC66,  __READ_WRITE )
__IO_REG8_BIT(  PF3H,            0xFFFFFC67,  __READ_WRITE )
__IO_REG8_BIT(  PF4,             0xFFFFFC68,  __READ_WRITE )
__IO_REG8_BIT(  PF5,             0xFFFFFC6A,  __READ_WRITE )

__IO_REG16(     PF9,             0xFFFFFC72,  __READ_WRITE )
__IO_REG8_BIT(  PF9L,            0xFFFFFC72,  __READ_WRITE )
__IO_REG8_BIT(  PF9H,            0xFFFFFC73,  __READ_WRITE )

__IO_REG8_BIT(  CB0CTL0,         0xFFFFFD00,  __READ_WRITE )
__IO_REG8_BIT(  CB0CTL1,         0xFFFFFD01,  __READ_WRITE )
__IO_REG8(      CB0CTL2,         0xFFFFFD02,  __READ_WRITE )
__IO_REG8_BIT(  CB0STR,          0xFFFFFD03,  __READ_WRITE )
__IO_REG16(     CB0RX,           0xFFFFFD04,  __READ       )
__IO_REG8(      CB0RXL,          0xFFFFFD04,  __READ       )
__IO_REG16(     CB0TX,           0xFFFFFD06,  __READ_WRITE )
__IO_REG8(      CB0TXL,          0xFFFFFD06,  __READ_WRITE )

__IO_REG8_BIT(  CB1CTL0,         0xFFFFFD10,  __READ_WRITE )
__IO_REG8_BIT(  CB1CTL1,         0xFFFFFD11,  __READ_WRITE )
__IO_REG8(      CB1CTL2,         0xFFFFFD12,  __READ_WRITE )
__IO_REG8_BIT(  CB1STR,          0xFFFFFD13,  __READ_WRITE )
__IO_REG16(     CB1RX,           0xFFFFFD14,  __READ       )
__IO_REG8(      CB1RXL,          0xFFFFFD14,  __READ       )
__IO_REG16(     CB1TX,           0xFFFFFD16,  __READ_WRITE )
__IO_REG8(      CB1TXL,          0xFFFFFD16,  __READ_WRITE )

__IO_REG8_BIT(  CB2CTL0,         0xFFFFFD20,  __READ_WRITE )
__IO_REG8_BIT(  CB2CTL1,         0xFFFFFD21,  __READ_WRITE )
__IO_REG8(      CB2CTL2,         0xFFFFFD22,  __READ_WRITE )
__IO_REG8_BIT(  CB2STR,          0xFFFFFD23,  __READ_WRITE )
__IO_REG16(     CB2RX,           0xFFFFFD24,  __READ       )
__IO_REG8(      CB2RXL,          0xFFFFFD24,  __READ       )
__IO_REG16(     CB2TX,           0xFFFFFD26,  __READ_WRITE )
__IO_REG8(      CB2TXL,          0xFFFFFD26,  __READ_WRITE )

__IO_REG8_BIT(  CB3CTL0,         0xFFFFFD30,  __READ_WRITE )
__IO_REG8_BIT(  CB3CTL1,         0xFFFFFD31,  __READ_WRITE )
__IO_REG8(      CB3CTL2,         0xFFFFFD32,  __READ_WRITE )
__IO_REG8_BIT(  CB3STR,          0xFFFFFD33,  __READ_WRITE )
__IO_REG16(     CB3RX,           0xFFFFFD34,  __READ       )
__IO_REG8(      CB3RXL,          0xFFFFFD34,  __READ       )
__IO_REG16(     CB3TX,           0xFFFFFD36,  __READ_WRITE )
__IO_REG8(      CB3TXL,          0xFFFFFD36,  __READ_WRITE )

__IO_REG8_BIT(  CB4CTL0,         0xFFFFFD40,  __READ_WRITE )
__IO_REG8_BIT(  CB4CTL1,         0xFFFFFD41,  __READ_WRITE )
__IO_REG8(      CB4CTL2,         0xFFFFFD42,  __READ_WRITE )
__IO_REG8_BIT(  CB4STR,          0xFFFFFD43,  __READ_WRITE )
__IO_REG16(     CB4RX,           0xFFFFFD44,  __READ       )
__IO_REG8(      CB4RXL,          0xFFFFFD44,  __READ       )
__IO_REG16(     CB4TX,           0xFFFFFD46,  __READ_WRITE )
__IO_REG8(      CB4TXL,          0xFFFFFD46,  __READ_WRITE )

__IO_REG8(      IIC0,            0xFFFFFD80,  __READ_WRITE )
__IO_REG8_BIT(  IICC0,           0xFFFFFD82,  __READ_WRITE )
__IO_REG8(      SVA0,            0xFFFFFD83,  __READ_WRITE )
__IO_REG8_BIT(  IICCL0,          0xFFFFFD84,  __READ_WRITE )
__IO_REG8_BIT(  IICX0,           0xFFFFFD85,  __READ_WRITE )
__IO_REG8_BIT(  IICS0,           0xFFFFFD86,  __READ       )

__IO_REG8_BIT(  IICF0,           0xFFFFFD8A,  __READ_WRITE )

__IO_REG8(      IIC1,            0xFFFFFD90,  __READ_WRITE )
__IO_REG8_BIT(  IICC1,           0xFFFFFD92,  __READ_WRITE )
__IO_REG8(      SVA1,            0xFFFFFD93,  __READ_WRITE )
__IO_REG8_BIT(  IICCL1,          0xFFFFFD94,  __READ_WRITE )
__IO_REG8_BIT(  IICX1,           0xFFFFFD95,  __READ_WRITE )
__IO_REG8_BIT(  IICS1,           0xFFFFFD96,  __READ       )

__IO_REG8_BIT(  IICF1,           0xFFFFFD9A,  __READ_WRITE )

__IO_REG8(      IIC2,            0xFFFFFDA0,  __READ_WRITE )
__IO_REG8_BIT(  IICC2,           0xFFFFFDA2,  __READ_WRITE )
__IO_REG8(      SVA2,            0xFFFFFDA3,  __READ_WRITE )
__IO_REG8_BIT(  IICCL2,          0xFFFFFDA4,  __READ_WRITE )
__IO_REG8_BIT(  IICX2,           0xFFFFFDA5,  __READ_WRITE )
__IO_REG8_BIT(  IICS2,           0xFFFFFDA6,  __READ       )

__IO_REG8_BIT(  IICF2,           0xFFFFFDAA,  __READ_WRITE )

__IO_REG8_BIT(  EXIMC,           0xFFFFFFBE,  __READ_WRITE )

/***********************************************
 *       Peripheral I/O bit declarations
 ***********************************************/

#ifdef __IAR_SYSTEMS_ICC__

#define E00               DCHC0_bit.no0
#define STG0              DCHC0_bit.no1
#define INIT0             DCHC0_bit.no2
#define TC0               DCHC0_bit.no7

#define E11               DCHC1_bit.no0
#define STG1              DCHC1_bit.no1
#define INIT1             DCHC1_bit.no2
#define TC1               DCHC1_bit.no7

#define E22               DCHC2_bit.no0
#define STG2              DCHC2_bit.no1
#define INIT2             DCHC2_bit.no2
#define TC2               DCHC2_bit.no7

#define E33               DCHC3_bit.no0
#define STG3              DCHC3_bit.no1
#define INIT3             DCHC3_bit.no2
#define TC3               DCHC3_bit.no7

#define LVIMK             LVIIC_bit.no6
#define LVIIF             LVIIC_bit.no7

#define PMK0              PIC0_bit.no6
#define PIF0              PIC0_bit.no7

#define PMK1              PIC1_bit.no6
#define PIF1              PIC1_bit.no7

#define PMK2              PIC2_bit.no6
#define PIF2              PIC2_bit.no7

#define PMK3              PIC3_bit.no6
#define PIF3              PIC3_bit.no7

#define PMK4              PIC4_bit.no6
#define PIF4              PIC4_bit.no7

#define PMK5              PIC5_bit.no6
#define PIF5              PIC5_bit.no7

#define PMK6              PIC6_bit.no6
#define PIF6              PIC6_bit.no7

#define PMK7              PIC7_bit.no6
#define PIF7              PIC7_bit.no7

#define TQ0OVMK           TQ0OVIC_bit.no6
#define TQ0OVIF           TQ0OVIC_bit.no7

#define TQ0CCMK0          TQ0CCIC0_bit.no6
#define TQ0CCIF0          TQ0CCIC0_bit.no7

#define TQ0CCMK1          TQ0CCIC1_bit.no6
#define TQ0CCIF1          TQ0CCIC1_bit.no7

#define TQ0CCMK2          TQ0CCIC2_bit.no6
#define TQ0CCIF2          TQ0CCIC2_bit.no7

#define TQ0CCMK3          TQ0CCIC3_bit.no6
#define TQ0CCIF3          TQ0CCIC3_bit.no7

