tlonch/contiki_ved/examples/nrf52dk/nrf51-sht2x-library-master/io70f3740.h
#define TP0OVMK           TP0OVIC_bit.no6
#define TP0OVIF           TP0OVIC_bit.no7

#define TP0CCMK0          TP0CCIC0_bit.no6
#define TP0CCIF0          TP0CCIC0_bit.no7

#define TP0CCMK1          TP0CCIC1_bit.no6
#define TP0CCIF1          TP0CCIC1_bit.no7

#define TP1OVMK           TP1OVIC_bit.no6
#define TP1OVIF           TP1OVIC_bit.no7

#define TP1CCMK0          TP1CCIC0_bit.no6
#define TP1CCIF0          TP1CCIC0_bit.no7

#define TP1CCMK1          TP1CCIC1_bit.no6
#define TP1CCIF1          TP1CCIC1_bit.no7

#define TP2OVMK           TP2OVIC_bit.no6
#define TP2OVIF           TP2OVIC_bit.no7

#define TP2CCMK0          TP2CCIC0_bit.no6
#define TP2CCIF0          TP2CCIC0_bit.no7

#define TP2CCMK1          TP2CCIC1_bit.no6
#define TP2CCIF1          TP2CCIC1_bit.no7

#define TP3OVMK           TP3OVIC_bit.no6
#define TP3OVIF           TP3OVIC_bit.no7

#define TP3CCMK0          TP3CCIC0_bit.no6
#define TP3CCIF0          TP3CCIC0_bit.no7

#define TP3CCMK1          TP3CCIC1_bit.no6
#define TP3CCIF1          TP3CCIC1_bit.no7

#define TP4OVMK           TP4OVIC_bit.no6
#define TP4OVIF           TP4OVIC_bit.no7

#define TP4CCMK0          TP4CCIC0_bit.no6
#define TP4CCIF0          TP4CCIC0_bit.no7

#define TP4CCMK1          TP4CCIC1_bit.no6
#define TP4CCIF1          TP4CCIC1_bit.no7

#define TP5OVMK           TP5OVIC_bit.no6
#define TP5OVIF           TP5OVIC_bit.no7

#define TP5CCMK0          TP5CCIC0_bit.no6
#define TP5CCIF0          TP5CCIC0_bit.no7

#define TP5CCMK1          TP5CCIC1_bit.no6
#define TP5CCIF1          TP5CCIC1_bit.no7

#define TM0EQMK0          TM0EQIC0_bit.no6
#define TM0EQIF0          TM0EQIC0_bit.no7

#define CB0RMK            IICIC1_bit.no6
#define IICMK1            IICIC1_bit.no6
#define CB0RIF            IICIC1_bit.no7
#define IICIF1            IICIC1_bit.no7

#define CB0TMK            CB0TIC_bit.no6
#define CB0TIF            CB0TIC_bit.no7

#define CB1RMK            CB1RIC_bit.no6
#define CB1RIF            CB1RIC_bit.no7

#define CB1TMK            CB1TIC_bit.no6
#define CB1TIF            CB1TIC_bit.no7

#define CB2RMK            CB2RIC_bit.no6
#define CB2RIF            CB2RIC_bit.no7

#define CB2TMK            CB2TIC_bit.no6
#define CB2TIF            CB2TIC_bit.no7

#define CB3RMK            CB3RIC_bit.no6
#define CB3RIF            CB3RIC_bit.no7

#define CB3TMK            CB3TIC_bit.no6
#define CB3TIF            CB3TIC_bit.no7

#define CB4RMK            UA0RIC_bit.no6
#define UA0RMK            UA0RIC_bit.no6
#define CB4RIF            UA0RIC_bit.no7
#define UA0RIF            UA0RIC_bit.no7

#define CB4TMK            UA0TIC_bit.no6
#define UA0TMK            UA0TIC_bit.no6
#define CB4TIF            UA0TIC_bit.no7
#define UA0TIF            UA0TIC_bit.no7

#define IICMK2            UA1RIC_bit.no6
#define UA1RMK            UA1RIC_bit.no6
#define IICIF2            UA1RIC_bit.no7
#define UA1RIF            UA1RIC_bit.no7

#define UA1TMK            UA1TIC_bit.no6
#define UA1TIF            UA1TIC_bit.no7

#define IICMK0            UA2RIC_bit.no6
#define UA2RMK            UA2RIC_bit.no6
#define IICIF0            UA2RIC_bit.no7
#define UA2RIF            UA2RIC_bit.no7

#define UA2TMK            UA2TIC_bit.no6
#define UA2TIF            UA2TIC_bit.no7

#define ADMK              ADIC_bit.no6
#define ADIF              ADIC_bit.no7

#define DMAMK0            DMAIC0_bit.no6
#define DMAIF0            DMAIC0_bit.no7

#define DMAMK1            DMAIC1_bit.no6
#define DMAIF1            DMAIC1_bit.no7

#define DMAMK2            DMAIC2_bit.no6
#define DMAIF2            DMAIC2_bit.no7

#define DMAMK3            DMAIC3_bit.no6
#define DMAIF3            DMAIC3_bit.no7

#define KRMK              KRIC_bit.no6
#define KRIF              KRIC_bit.no7

#define WTIMK             WTIIC_bit.no6
#define WTIIF             WTIIC_bit.no7

#define WTMK              WTIC_bit.no6
#define WTIF              WTIC_bit.no7

#define ISPR0             ISPR_bit.no0
#define ISPR1             ISPR_bit.no1
#define ISPR2             ISPR_bit.no2
#define ISPR3             ISPR_bit.no3
#define ISPR4             ISPR_bit.no4
#define ISPR5             ISPR_bit.no5
#define ISPR6             ISPR_bit.no6
#define ISPR7             ISPR_bit.no7

#define STP               PSC_bit.no1
#define INTM              PSC_bit.no4
#define NMI0M             PSC_bit.no5
#define NMI1M             PSC_bit.no6

#define ADA0EF            ADA0M0_bit.no0
#define ADA0CE            ADA0M0_bit.no7

#define ADA0PFE           ADA0PFM_bit.no7

#define DA0CE0            DA0M_bit.no4
#define DA0CE1            DA0M_bit.no5

#define ISEL3             SELCNT0_bit.no3
#define ISEL4             SELCNT0_bit.no4

#define BGCE1             PRSM1_bit.no4

#define BGCE2             PRSM2_bit.no4

#define BGCE3             PRSM3_bit.no4

#define TQ0CE             TQ0CTL0_bit.no7

#define TQ0EEE            TQ0CTL1_bit.no5
#define TQ0EST            TQ0CTL1_bit.no6

#define TQ0OE0            TQ0IOC0_bit.no0
#define TQ0OE1            TQ0IOC0_bit.no2
#define TQ0OE2            TQ0IOC0_bit.no4
#define TQ0OE3            TQ0IOC0_bit.no6

#define TQ0OVF            TQ0OPT0_bit.no0

#define TP0CE             TP0CTL0_bit.no7

#define TP0EEE            TP0CTL1_bit.no5
#define TP0EST            TP0CTL1_bit.no6

#define TP0OE0            TP0IOC0_bit.no0
#define TP0OE1            TP0IOC0_bit.no2

#define TP0OVF            TP0OPT0_bit.no0

#define TP1CE             TP1CTL0_bit.no7

#define TP1EEE            TP1CTL1_bit.no5
#define TP1EST            TP1CTL1_bit.no6

#define TP1OE0            TP1IOC0_bit.no0
#define TP1OE1            TP1IOC0_bit.no2

#define TP1OVF            TP1OPT0_bit.no0

#define TP2CE             TP2CTL0_bit.no7

#define TP2EEE            TP2CTL1_bit.no5
#define TP2EST            TP2CTL1_bit.no6

#define TP2OE0            TP2IOC0_bit.no0
#define TP2OE1            TP2IOC0_bit.no2

#define TP2OVF            TP2OPT0_bit.no0

#define TP3CE             TP3CTL0_bit.no7

#define TP3EEE            TP3CTL1_bit.no5
#define TP3EST            TP3CTL1_bit.no6

#define TP3OE0            TP3IOC0_bit.no0
#define TP3OE1            TP3IOC0_bit.no2

#define TP3OVF            TP3OPT0_bit.no0

#define TP4CE             TP4CTL0_bit.no7

#define TP4EEE            TP4CTL1_bit.no5
#define TP4EST            TP4CTL1_bit.no6

#define TP4OE0            TP4IOC0_bit.no0
#define TP4OE1            TP4IOC0_bit.no2

#define TP4OVF            TP4OPT0_bit.no0

#define TP5CE             TP5CTL0_bit.no7

#define TP5EEE            TP5CTL1_bit.no5
#define TP5EST            TP5CTL1_bit.no6

#define TP5OE0            TP5IOC0_bit.no0
#define TP5OE1            TP5IOC0_bit.no2

#define TP5OVF            TP5OPT0_bit.no0

#define WTM0              WTM_bit.no0
#define WTM1              WTM_bit.no1

#define TM0CE             TM0CTL0_bit.no7

#define RTPOE0            RTPC0_bit.no7

#define PRERR             SYS_bit.no0

#define RSTOP             RCM_bit.no0

