tlonch/contiki_ved/examples/nrf52dk/nrf51-sht2x-library-master/io70f3740.h
#define DF0               DTFR0_bit.no7

#define DF1               DTFR1_bit.no7

#define DF2               DTFR2_bit.no7

#define DF3               DTFR3_bit.no7

#define PSM0              PSMR_bit.no0
#define PSM1              PSMR_bit.no1

#define LOCK              LOCKR_bit.no0

#define CK3               PCC_bit.no3
#define CLS               PCC_bit.no4
#define MCK               PCC_bit.no6

#define PLLON             PLLCTL_bit.no0
#define SELPLL            PLLCTL_bit.no1

#define CLME              CLM_bit.no0

#define LVIF              LVIM_bit.no0
#define LVIMD             LVIM_bit.no1
#define LVION             LVIM_bit.no7

#define RAMF              RAMS_bit.no0

#define BGCE0             PRSM0_bit.no4

#define OCDM0             OCDM_bit.no0

#define UA0DIR            UA0CTL0_bit.no4
#define UA0RXE            UA0CTL0_bit.no5
#define UA0TXE            UA0CTL0_bit.no6
#define UA0PWR            UA0CTL0_bit.no7

#define UA0SRF            UA0OPT0_bit.no7

#define UA0OVE            UA0STR_bit.no0
#define UA0FE             UA0STR_bit.no1
#define UA0PE             UA0STR_bit.no2
#define UA0TSF            UA0STR_bit.no7

#define UA1DIR            UA1CTL0_bit.no4
#define UA1RXE            UA1CTL0_bit.no5
#define UA1TXE            UA1CTL0_bit.no6
#define UA1PWR            UA1CTL0_bit.no7

#define UA1SRF            UA1OPT0_bit.no7

#define UA1OVE            UA1STR_bit.no0
#define UA1FE             UA1STR_bit.no1
#define UA1PE             UA1STR_bit.no2
#define UA1TSF            UA1STR_bit.no7

#define UA2DIR            UA2CTL0_bit.no4
#define UA2RXE            UA2CTL0_bit.no5
#define UA2TXE            UA2CTL0_bit.no6
#define UA2PWR            UA2CTL0_bit.no7

#define UA2SRF            UA2OPT0_bit.no7

#define UA2OVE            UA2STR_bit.no0
#define UA2FE             UA2STR_bit.no1
#define UA2PE             UA2STR_bit.no2
#define UA2TSF            UA2STR_bit.no7

#define CB0SCE            CB0CTL0_bit.no0
#define CB0DIR            CB0CTL0_bit.no4
#define CB0RXE            CB0CTL0_bit.no5
#define CB0TXE            CB0CTL0_bit.no6
#define CB0PWR            CB0CTL0_bit.no7

#define CB0OVE            CB0STR_bit.no0
#define CB0TSF            CB0STR_bit.no7

#define CB1SCE            CB1CTL0_bit.no0
#define CB1DIR            CB1CTL0_bit.no4
#define CB1RXE            CB1CTL0_bit.no5
#define CB1TXE            CB1CTL0_bit.no6
#define CB1PWR            CB1CTL0_bit.no7

#define CB1OVE            CB1STR_bit.no0
#define CB1TSF            CB1STR_bit.no7

#define CB2SCE            CB2CTL0_bit.no0
#define CB2DIR            CB2CTL0_bit.no4
#define CB2RXE            CB2CTL0_bit.no5
#define CB2TXE            CB2CTL0_bit.no6
#define CB2PWR            CB2CTL0_bit.no7

#define CB2OVE            CB2STR_bit.no0
#define CB2TSF            CB2STR_bit.no7

#define CB3SCE            CB3CTL0_bit.no0
#define CB3DIR            CB3CTL0_bit.no4
#define CB3RXE            CB3CTL0_bit.no5
#define CB3TXE            CB3CTL0_bit.no6
#define CB3PWR            CB3CTL0_bit.no7

#define CB3OVE            CB3STR_bit.no0
#define CB3TSF            CB3STR_bit.no7

#define CB4SCE            CB4CTL0_bit.no0
#define CB4DIR            CB4CTL0_bit.no4
#define CB4RXE            CB4CTL0_bit.no5
#define CB4TXE            CB4CTL0_bit.no6
#define CB4PWR            CB4CTL0_bit.no7

#define CB4OVE            CB4STR_bit.no0
#define CB4TSF            CB4STR_bit.no7

#define SPT0              IICC0_bit.no0
#define STT0              IICC0_bit.no1
#define ACKE0             IICC0_bit.no2
#define WTIM0             IICC0_bit.no3
#define SPIE0             IICC0_bit.no4
#define WREL0             IICC0_bit.no5
#define LREL0             IICC0_bit.no6
#define IICE0             IICC0_bit.no7

#define DAD0              IICCL0_bit.no4
#define CLD0              IICCL0_bit.no5

#define CLX0              IICX0_bit.no0

#define SPD0              IICS0_bit.no0
#define STD0              IICS0_bit.no1
#define ACKD0             IICS0_bit.no2
#define TRC0              IICS0_bit.no3
#define COI0              IICS0_bit.no4
#define EXC0              IICS0_bit.no5
#define ALD0              IICS0_bit.no6
#define MSTS0             IICS0_bit.no7

#define IICRSV0           IICF0_bit.no0
#define STCEN0            IICF0_bit.no1
#define IICBSY0           IICF0_bit.no6
#define STCF0             IICF0_bit.no7

#define SPT1              IICC1_bit.no0
#define STT1              IICC1_bit.no1
#define ACKE1             IICC1_bit.no2
#define WTIM1             IICC1_bit.no3
#define SPIE1             IICC1_bit.no4
#define WREL1             IICC1_bit.no5
#define LREL1             IICC1_bit.no6
#define IICE1             IICC1_bit.no7

#define DAD1              IICCL1_bit.no4
#define CLD1              IICCL1_bit.no5

#define CLX1              IICX1_bit.no0

#define SPD1              IICS1_bit.no0
#define STD1              IICS1_bit.no1
#define ACKD1             IICS1_bit.no2
#define TRC1              IICS1_bit.no3
#define COI1              IICS1_bit.no4
#define EXC1              IICS1_bit.no5
#define ALD1              IICS1_bit.no6
#define MSTS1             IICS1_bit.no7

#define IICRSV1           IICF1_bit.no0
#define STCEN1            IICF1_bit.no1
#define IICBSY1           IICF1_bit.no6
#define STCF1             IICF1_bit.no7

#define SPT2              IICC2_bit.no0
#define STT2              IICC2_bit.no1
#define ACKE2             IICC2_bit.no2
#define WTIM2             IICC2_bit.no3
#define SPIE2             IICC2_bit.no4
#define WREL2             IICC2_bit.no5
#define LREL2             IICC2_bit.no6
#define IICE2             IICC2_bit.no7

#define DAD2              IICCL2_bit.no4
#define CLD2              IICCL2_bit.no5

#define CLX2              IICX2_bit.no0

#define SPD2              IICS2_bit.no0
#define STD2              IICS2_bit.no1
#define ACKD2             IICS2_bit.no2
#define TRC2              IICS2_bit.no3
#define COI2              IICS2_bit.no4
#define EXC2              IICS2_bit.no5
#define ALD2              IICS2_bit.no6
#define MSTS2             IICS2_bit.no7

#define IICRSV2           IICF2_bit.no0
#define STCEN2            IICF2_bit.no1
#define IICBSY2           IICF2_bit.no6
#define STCF2             IICF2_bit.no7

#endif /* __IAR_SYSTEMS_ICC__ */

/***********************************************
 *       Interrupt/Exeption table declarations
 ***********************************************/

#define RESET_vector             (0x0000)
#define NMI_vector               (0x0010)
#define INTWDT2_vector           (0x0020)
#define DBG0_vector              (0x0060)
#define ILGOP_vector             (0x0060)
#define SECURITY_ID_vector       (0x0070)
#define INTLVI_vector            (0x0080)
#define INTP0_vector             (0x0090)
#define INTP1_vector             (0x00A0)
#define INTP2_vector             (0x00B0)
#define INTP3_vector             (0x00C0)
#define INTP4_vector             (0x00D0)
#define INTP5_vector             (0x00E0)
#define INTP6_vector             (0x00F0)
#define INTP7_vector             (0x0100)
#define INTTQ0OV_vector          (0x0110)
#define INTTQ0CC0_vector         (0x0120)
#define INTTQ0CC1_vector         (0x0130)
#define INTTQ0CC2_vector         (0x0140)
#define INTTQ0CC3_vector         (0x0150)
#define INTTP0OV_vector          (0x0160)
#define INTTP0CC0_vector         (0x0170)
#define INTTP0CC1_vector         (0x0180)
#define INTTP1OV_vector          (0x0190)
#define INTTP1CC0_vector         (0x01A0)
#define INTTP1CC1_vector         (0x01B0)
#define INTTP2OV_vector          (0x01C0)
#define INTTP2CC0_vector         (0x01D0)
#define INTTP2CC1_vector         (0x01E0)
#define INTTP3OV_vector          (0x01F0)
#define INTTP3CC0_vector         (0x0200)
#define INTTP3CC1_vector         (0x0210)
#define INTTP4OV_vector          (0x0220)
#define INTTP4CC0_vector         (0x0230)
#define INTTP4CC1_vector         (0x0240)
#define INTTP5OV_vector          (0x0250)
#define INTTP5CC0_vector         (0x0260)
#define INTTP5CC1_vector         (0x0270)
#define INTTM0EQ0_vector         (0x0280)
#define INTCB0R_vector           (0x0290)
#define INTIIC1_vector           (0x0290)
#define INTCB0T_vector           (0x02A0)
#define INTCB1R_vector           (0x02B0)
#define INTCB1T_vector           (0x02C0)
#define INTCB2R_vector           (0x02D0)
#define INTCB2T_vector           (0x02E0)
#define INTCB3R_vector           (0x02F0)
#define INTCB3T_vector           (0x0300)
#define INTCB4R_vector           (0x0310)
#define INTUA0R_vector           (0x0310)
#define INTCB4T_vector           (0x0320)
#define INTUA0T_vector           (0x0320)
#define INTIIC2_vector           (0x0330)
#define INTUA1R_vector           (0x0330)
#define INTUA1T_vector           (0x0340)
#define INTIIC0_vector           (0x0350)
#define INTUA2R_vector           (0x0350)
#define INTUA2T_vector           (0x0360)
#define INTAD_vector             (0x0370)
#define INTDMA0_vector           (0x0380)
#define INTDMA1_vector           (0x0390)
#define INTDMA2_vector           (0x03A0)
#define INTDMA3_vector           (0x03B0)
#define INTKR_vector             (0x03C0)
#define INTWTI_vector            (0x03D0)
#define INTWT_vector             (0x03E0)

/***********************************************
 *       Trap vectors
 ***********************************************/

#define TRAP00_vector      (0x00)
#define TRAP01_vector      (0x01)
#define TRAP02_vector      (0x02)
#define TRAP03_vector      (0x03)
#define TRAP04_vector      (0x04)
#define TRAP05_vector      (0x05)
#define TRAP06_vector      (0x06)
#define TRAP07_vector      (0x07)
#define TRAP08_vector      (0x08)
#define TRAP09_vector      (0x09)
#define TRAP0A_vector      (0x0A)
#define TRAP0B_vector      (0x0B)
#define TRAP0C_vector      (0x0C)
#define TRAP0D_vector      (0x0D)
#define TRAP0E_vector      (0x0E)
#define TRAP0F_vector      (0x0F)
#define TRAP10_vector      (0x10)
#define TRAP11_vector      (0x11)
#define TRAP12_vector      (0x12)
#define TRAP13_vector      (0x13)
#define TRAP14_vector      (0x14)
#define TRAP15_vector      (0x15)
#define TRAP16_vector      (0x16)
#define TRAP17_vector      (0x17)
#define TRAP18_vector      (0x18)
#define TRAP19_vector      (0x19)
#define TRAP1A_vector      (0x1A)
#define TRAP1B_vector      (0x1B)
#define TRAP1C_vector      (0x1C)
#define TRAP1D_vector      (0x1D)
#define TRAP1E_vector      (0x1E)
#define TRAP1F_vector      (0x1F)

#pragma language=default

#endif /* __IO70F3740_H__ */
